Revit 2027 API
BuiltInFailures.AlignmentFailures Class
 Failures related to alignment elements and annotations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.AlignmentFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class AlignmentFailures
Public NotInheritable Class AlignmentFailures
public ref class AlignmentFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AlignmentFailures = class end
The BuiltInFailures.AlignmentFailures type exposes the following members.
Properties
Name | Description
AlignmentCheckStationLabels |  A change to an Infrastructure Alignment or its Stationing Units may have affected the associated Alignment Station Labels. Please check the labels to ensure proper placement.
Top
See Also
Reference
Autodesk.Revit.DB Namespace